:orange_circle:
```
sudo docker compose run --rm devops-utils sh -c 'cd components/test-vpc; terraform plan -no-color -var-file="../../accounts/infrastructure/network/var.tfvars"'
module.vpc.aws_vpc.this: Refreshing state... [id=vpc-07a35b024555ea00e]
module.vpc.aws_internet_gateway.this: Refreshing state... [id=igw-091198532cfeff259]
module.vpc.module.tier["public_subnet"].aws_subnet.this[0]: Refreshing state... [id=subnet-049ce40be4510c019]
module.vpc.module.tier["public_subnet"].aws_subnet.this[2]: Refreshing state... [id=subnet-0bdf17d87760c47d6]
module.vpc.module.tier["public_subnet"].aws_subnet.this[1]: Refreshing state... [id=subnet-0d7e674ce633ceab3]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpc.aws_internet_gateway.this will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"  = "devops-igw"
          + "Owner" = "arthur"
        }
      + tags_all = {
          + "Name"  = "devops-igw"
          + "Owner" = "arthur"
        }
      + vpc_id   = "vpc-07a35b024555ea00e"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```